## Data Merging (data merging is done using pandas (liberary))

In [2]:
# import liberaries
import pandas as pd

In [3]:
df1 = {
    'ID': [1, 2, 3],
    'name': ['Ahmed', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}

In [4]:
# converting into pandas DataFrame
df1 = pd.DataFrame(df1)
df1.head()

   ID    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [5]:
df2 = {
    'ID': [1, 2, 3],
    'city': ['Karachi', 'Lahore', 'Islamabad'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}

In [6]:
# similarly, converting into pandas DataFrame
df2 = pd.DataFrame(df2)
df2.head()

   ID       city occupation
0   1    Karachi   Engineer
1   2     Lahore     Doctor
2   3  Islamabad    Teacher

In [7]:
# merging (merging is done on the unique value in both the dataframes) both the DataFrames 
merged_data = pd.merge(df1, df2, on = 'ID', how = 'inner')
merged_data

   ID    name  age       city occupation
0   1   Ahmed   28    Karachi   Engineer
1   2  Fatima   32     Lahore     Doctor
2   3     Ali   24  Islamabad    Teacher

## Now, If we change the ID's :

In [11]:
df1 = {
    'ID': [1, 2, 3],
    'name': ['Ahmed', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}

In [12]:
df1 = pd.DataFrame(df1)
df1.head()

   ID    name  age
0   1   Ahmed   28
1   2  Fatima   32
2   3     Ali   24

In [15]:
df2 = {
    'ID': [1, 4, 3],
    'city': ['Karachi', 'Lahore', 'Islamabad'],
    'occupation': ['Engineer', 'Doctor', 'Teacher']
}

In [16]:
df2 = pd.DataFrame(df2)
df2.head()

   ID       city occupation
0   1    Karachi   Engineer
1   4     Lahore     Doctor
2   3  Islamabad    Teacher

In [20]:
merged_data = pd.merge(df1, df2, on = 'ID', how = 'inner')
merged_data
# here you can see in df1(ID = 2) and in df2(ID = 4) data is not merged

   ID   name  age       city occupation
0   1  Ahmed   28    Karachi   Engineer
1   3    Ali   24  Islamabad    Teacher

## Concatenation

In [42]:
import pandas as pd

In [43]:
# three DataFrames 
df1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}
df2 = {'Name': ['Sara', 'Usman', 'Aisha'], 'Age': [29, 35, 27]}
df3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'Islamabad']}
# converting these DataFrames into pandas DataFrame
df1 = pd.DataFrame(df1)
df2 = pd.DataFrame(df2)
df3 = pd.DataFrame(df3)
df1, df2, df3

(     Name  Age
 0   Ahmed   28
 1  Fatima   32
 2     Ali   24,
     Name  Age
 0   Sara   29
 1  Usman   35
 2  Aisha   27,
         City   Province
 0    Karachi      Sindh
 1     Lahore     Punjab
 2  Islamabad  Islamabad)

In [44]:
# concatenating rows
concatenated_rows = pd.concat([df1,df2], axis = 0)
concatenated_rows

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27

In [45]:
# concatenating columns
concatenated_columns = pd.concat([df1, df3], axis = 1)
concatenated_columns

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad